twatorowski/stm32l476-radio-receiver/stm32h743/rcc.h
/* @file rcc.h
 * 
 * @date 2021-01-19
 * @author twatorowski 
 * 
 * @brief STM32H743: RCC
 */

#ifndef STM32H743_RCC_H
#define STM32H743_RCC_H

#include "stm32h743/stm32h743.h"

/* base addresses */
#define RCC_BASE                                            0x58024400U        

/* instances */
#define RCC                                                 ((rcc_t *)RCC_BASE)

/* register bank */
typedef struct {
    reg32_t CR;
    reg32_t ICSCR;
    reg32_t CRRCR;
    reg8_t RESERVED0[4];
    reg32_t CFGR;
    reg8_t RESERVED1[4];
    reg32_t D1CFGR;
    reg32_t D2CFGR;
    reg32_t D3CFGR;
    reg8_t RESERVED2[4];
    reg32_t PLLCKSELR;
    reg32_t PLLCFGR;
    reg32_t PLL1DIVR;
    reg32_t PLL1FRACR;
    reg32_t PLL2DIVR;
    reg32_t PLL2FRACR;
    reg32_t PLL3DIVR;
    reg32_t PLL3FRACR;
    reg8_t RESERVED3[4];
    reg32_t D1CCIPR;
    reg32_t D2CCIP1R;
    reg32_t D2CCIP2R;
    reg32_t D3CCIPR;
    reg8_t RESERVED4[4];
    reg32_t CIER;
    reg32_t CIFR;
    reg32_t CICR;
    reg8_t RESERVED5[4];
    reg32_t BDCR;
    reg32_t CSR;
    reg8_t RESERVED6[4];
    reg32_t AHB3RSTR;
    reg32_t AHB1RSTR;
    reg32_t AHB2RSTR;
    reg32_t AHB4RSTR;
    reg32_t APB3RSTR;
    reg32_t APB1LRSTR;
    reg32_t APB1HRSTR;
    reg32_t APB2RSTR;
    reg32_t APB4RSTR;
    reg32_t GCR;
    reg8_t RESERVED7[4];
    reg32_t D3AMR;
    reg8_t RESERVED8[36];
    reg32_t RSR;
    reg32_t AHB3ENR;
    reg32_t AHB1ENR;
    reg32_t AHB2ENR;
    reg32_t AHB4ENR;
    reg32_t APB3ENR;
    reg32_t APB1LENR;
    reg32_t APB1HENR;
    reg32_t APB2ENR;
    reg32_t APB4ENR;
    reg8_t RESERVED9[4];
    reg32_t AHB3LPENR;
    reg32_t AHB1LPENR;
    reg32_t AHB2LPENR;
    reg32_t AHB4LPENR;
    reg32_t APB3LPENR;
    reg32_t APB1LLPENR;
    reg32_t APB1HLPENR;
    reg32_t APB2LPENR;
    reg32_t APB4LPENR;
    reg8_t RESERVED10[16];
    reg32_t C1_RSR;
    reg32_t C1_AHB3ENR;
    reg32_t C1_AHB1ENR;
    reg32_t C1_AHB2ENR;
    reg32_t C1_AHB4ENR;
    reg32_t C1_APB3ENR;
    reg32_t C1_APB1LENR;
    reg32_t C1_APB1HENR;
    reg32_t C1_APB2ENR;
    reg32_t C1_APB4ENR;
    reg8_t RESERVED11[4];
    reg32_t C1_AHB3LPENR;
    reg32_t C1_AHB1LPENR;
    reg32_t C1_AHB2LPENR;
    reg32_t C1_AHB4LPENR;
    reg32_t C1_APB3LPENR;
    reg32_t C1_APB1LLPENR;
    reg32_t C1_APB1HLPENR;
    reg32_t C1_APB2LPENR;
    reg32_t C1_APB4LPENR;
} rcc_t;

/******************* bit definitions for CR register ********************/
#define RCC_CR_HSION                                        0x00000001
#define RCC_CR_HSIKERON                                     0x00000002
#define RCC_CR_HSIRDY                                       0x00000004
#define RCC_CR_HSIDIV                                       0x00000018
#define RCC_CR_HSIDIVF                                      0x00000020
#define RCC_CR_CSION                                        0x00000080
#define RCC_CR_CSIRDY                                       0x00000100
#define RCC_CR_CSIKERON                                     0x00000200
#define RCC_CR_RC48ON                                       0x00001000
#define RCC_CR_RC48RDY                                      0x00002000
#define RCC_CR_D1CKRDY                                      0x00004000
#define RCC_CR_D2CKRDY                                      0x00008000
#define RCC_CR_HSEON                                        0x00010000
#define RCC_CR_HSERDY                                       0x00020000
#define RCC_CR_HSEBYP                                       0x00040000
#define RCC_CR_HSECSSON                                     0x00080000
#define RCC_CR_PLL1ON                                       0x01000000
#define RCC_CR_PLL1RDY                                      0x02000000
#define RCC_CR_PLL2ON                                       0x04000000
#define RCC_CR_PLL2RDY                                      0x08000000
#define RCC_CR_PLL3ON                                       0x10000000
#define RCC_CR_PLL3RDY                                      0x20000000

/****************** bit definitions for ICSCR register ******************/
#define RCC_ICSCR_HSICAL                                    0x00000fff
#define RCC_ICSCR_HSITRIM                                   0x0003f000
#define RCC_ICSCR_CSICAL                                    0x03fc0000
#define RCC_ICSCR_CSITRIM                                   0x7c000000

/****************** bit definitions for CRRCR register ******************/
#define RCC_CRRCR_RC48CAL                                   0x000003ff

/****************** bit definitions for CFGR register *******************/
#define RCC_CFGR_SW                                         0x00000007
#define RCC_CFGR_SWS                                        0x00000038
#define RCC_CFGR_STOPWUCK                                   0x00000040
#define RCC_CFGR_STOPKERWUCK                                0x00000080
#define RCC_CFGR_RTCPRE                                     0x00003f00
#define RCC_CFGR_HRTIMSEL                                   0x00004000
#define RCC_CFGR_TIMPRE                                     0x00008000
#define RCC_CFGR_MCO1PRE                                    0x003c0000
#define RCC_CFGR_MCO1SEL                                    0x01c00000
#define RCC_CFGR_MCO2PRE                                    0x1e000000
#define RCC_CFGR_MCO2SEL                                    0xe0000000

/***************** bit definitions for D1CFGR register ******************/
#define RCC_D1CFGR_HPRE                                     0x0000000f
#define RCC_D1CFGR_D1PPRE                                   0x00000070
#define RCC_D1CFGR_D1CPRE                                   0x00000f00

/***************** bit definitions for D2CFGR register ******************/
#define RCC_D2CFGR_D2PPRE1                                  0x00000070
#define RCC_D2CFGR_D2PPRE2                                  0x00000700

/***************** bit definitions for D3CFGR register ******************/
#define RCC_D3CFGR_D3PPRE                                   0x00000070

