twatorowski/stm32l476-radio-receiver/stm32h743/rcc.h
/**************** bit definitions for PLLCKSELR register ****************/
#define RCC_PLLCKSELR_PLLSRC                                0x00000003
#define RCC_PLLCKSELR_DIVM1                                 0x000003f0
#define RCC_PLLCKSELR_DIVM2                                 0x0003f000
#define RCC_PLLCKSELR_DIVM3                                 0x03f00000

/***************** bit definitions for PLLCFGR register *****************/
#define RCC_PLLCFGR_PLL1FRACEN                              0x00000001
#define RCC_PLLCFGR_PLL1VCOSEL                              0x00000002
#define RCC_PLLCFGR_PLL1RGE                                 0x0000000c
#define RCC_PLLCFGR_PLL2FRACEN                              0x00000010
#define RCC_PLLCFGR_PLL2VCOSEL                              0x00000020
#define RCC_PLLCFGR_PLL2RGE                                 0x000000c0
#define RCC_PLLCFGR_PLL3FRACEN                              0x00000100
#define RCC_PLLCFGR_PLL3VCOSEL                              0x00000200
#define RCC_PLLCFGR_PLL3RGE                                 0x00000c00
#define RCC_PLLCFGR_DIVP1EN                                 0x00010000
#define RCC_PLLCFGR_DIVQ1EN                                 0x00020000
#define RCC_PLLCFGR_DIVR1EN                                 0x00040000
#define RCC_PLLCFGR_DIVP2EN                                 0x00080000
#define RCC_PLLCFGR_DIVQ2EN                                 0x00100000
#define RCC_PLLCFGR_DIVR2EN                                 0x00200000
#define RCC_PLLCFGR_DIVP3EN                                 0x00400000
#define RCC_PLLCFGR_DIVQ3EN                                 0x00800000
#define RCC_PLLCFGR_DIVR3EN                                 0x01000000

/**************** bit definitions for PLL1DIVR register *****************/
#define RCC_PLL1DIVR_DIVN1                                  0x000001ff
#define RCC_PLL1DIVR_DIVP1                                  0x0000fe00
#define RCC_PLL1DIVR_DIVQ1                                  0x007f0000
#define RCC_PLL1DIVR_DIVR1                                  0x7f000000

/**************** bit definitions for PLL1FRACR register ****************/
#define RCC_PLL1FRACR_FRACN1                                0x0000fff8

/**************** bit definitions for PLL2DIVR register *****************/
#define RCC_PLL2DIVR_DIVN1                                  0x000001ff
#define RCC_PLL2DIVR_DIVP1                                  0x0000fe00
#define RCC_PLL2DIVR_DIVQ1                                  0x007f0000
#define RCC_PLL2DIVR_DIVR1                                  0x7f000000

/**************** bit definitions for PLL2FRACR register ****************/
#define RCC_PLL2FRACR_FRACN2                                0x0000fff8

/**************** bit definitions for PLL3DIVR register *****************/
#define RCC_PLL3DIVR_DIVN3                                  0x000001ff
#define RCC_PLL3DIVR_DIVP3                                  0x0000fe00
#define RCC_PLL3DIVR_DIVQ3                                  0x007f0000
#define RCC_PLL3DIVR_DIVR3                                  0x7f000000

/**************** bit definitions for PLL3FRACR register ****************/
#define RCC_PLL3FRACR_FRACN3                                0x0000fff8

/***************** bit definitions for D1CCIPR register *****************/
#define RCC_D1CCIPR_FMCSRC                                  0x00000003
#define RCC_D1CCIPR_QSPISRC                                 0x00000030
#define RCC_D1CCIPR_SDMMCSRC                                0x00010000
#define RCC_D1CCIPR_CKPERSRC                                0x30000000

/**************** bit definitions for D2CCIP1R register *****************/
#define RCC_D2CCIP1R_SAI1SRC                                0x00000007
#define RCC_D2CCIP1R_SAI23SRC                               0x000001c0
#define RCC_D2CCIP1R_SPI123SRC                              0x00007000
#define RCC_D2CCIP1R_SPI45SRC                               0x00070000
#define RCC_D2CCIP1R_SPDIFSRC                               0x00300000
#define RCC_D2CCIP1R_DFSDM1SRC                              0x01000000
#define RCC_D2CCIP1R_FDCANSRC                               0x30000000
#define RCC_D2CCIP1R_SWPSRC                                 0x80000000

/**************** bit definitions for D2CCIP2R register *****************/
#define RCC_D2CCIP2R_USART234578SRC                         0x00000007
#define RCC_D2CCIP2R_USART16SRC                             0x00000038
#define RCC_D2CCIP2R_RNGSRC                                 0x00000300
#define RCC_D2CCIP2R_I2C123SRC                              0x00003000
#define RCC_D2CCIP2R_USBSRC                                 0x00300000
#define RCC_D2CCIP2R_CECSRC                                 0x00c00000
#define RCC_D2CCIP2R_LPTIM1SRC                              0x70000000

/***************** bit definitions for D3CCIPR register *****************/
#define RCC_D3CCIPR_LPUART1SRC                              0x00000007
#define RCC_D3CCIPR_I2C4SRC                                 0x00000300
#define RCC_D3CCIPR_LPTIM2SRC                               0x00001c00
#define RCC_D3CCIPR_LPTIM345SRC                             0x0000e000
#define RCC_D3CCIPR_ADCSRC                                  0x00030000
#define RCC_D3CCIPR_SAI4ASRC                                0x00e00000
#define RCC_D3CCIPR_SAI4BSRC                                0x07000000
#define RCC_D3CCIPR_SPI6SRC                                 0x70000000

/****************** bit definitions for CIER register *******************/
#define RCC_CIER_LSIRDYIE                                   0x00000001
#define RCC_CIER_LSERDYIE                                   0x00000002
#define RCC_CIER_HSIRDYIE                                   0x00000004
#define RCC_CIER_HSERDYIE                                   0x00000008
#define RCC_CIER_CSIRDYIE                                   0x00000010
#define RCC_CIER_RC48RDYIE                                  0x00000020
#define RCC_CIER_PLL1RDYIE                                  0x00000040
#define RCC_CIER_PLL2RDYIE                                  0x00000080
#define RCC_CIER_PLL3RDYIE                                  0x00000100
#define RCC_CIER_LSECSSIE                                   0x00000200

/****************** bit definitions for CIFR register *******************/
#define RCC_CIFR_LSIRDYF                                    0x00000001
#define RCC_CIFR_LSERDYF                                    0x00000002
#define RCC_CIFR_HSIRDYF                                    0x00000004
#define RCC_CIFR_HSERDYF                                    0x00000008
#define RCC_CIFR_CSIRDY                                     0x00000010
#define RCC_CIFR_RC48RDYF                                   0x00000020
#define RCC_CIFR_PLL1RDYF                                   0x00000040
#define RCC_CIFR_PLL2RDYF                                   0x00000080
#define RCC_CIFR_PLL3RDYF                                   0x00000100
#define RCC_CIFR_LSECSSF                                    0x00000200
#define RCC_CIFR_HSECSSF                                    0x00000400

/****************** bit definitions for CICR register *******************/
#define RCC_CICR_LSIRDYC                                    0x00000001
#define RCC_CICR_LSERDYC                                    0x00000002
#define RCC_CICR_HSIRDYC                                    0x00000004
#define RCC_CICR_HSERDYC                                    0x00000008
#define RCC_CICR_HSE_READY_INTERRUPT_CLEAR                  0x00000010
#define RCC_CICR_RC48RDYC                                   0x00000020
#define RCC_CICR_PLL1RDYC                                   0x00000040
#define RCC_CICR_PLL2RDYC                                   0x00000080
#define RCC_CICR_PLL3RDYC                                   0x00000100
#define RCC_CICR_LSECSSC                                    0x00000200
#define RCC_CICR_HSECSSC                                    0x00000400

/****************** bit definitions for BDCR register *******************/
#define RCC_BDCR_LSEON                                      0x00000001
#define RCC_BDCR_LSERDY                                     0x00000002
#define RCC_BDCR_LSEBYP                                     0x00000004
#define RCC_BDCR_LSEDRV                                     0x00000018
#define RCC_BDCR_LSECSSON                                   0x00000020
#define RCC_BDCR_LSECSSD                                    0x00000040
#define RCC_BDCR_RTCSRC                                     0x00000300
#define RCC_BDCR_RTCEN                                      0x00008000
#define RCC_BDCR_VSWRST                                     0x00010000

/******************* bit definitions for CSR register *******************/
#define RCC_CSR_LSION                                       0x00000001
#define RCC_CSR_LSIRDY                                      0x00000002

/**************** bit definitions for AHB3RSTR register *****************/
#define RCC_AHB3RSTR_MDMARST                                0x00000001
#define RCC_AHB3RSTR_DMA2DRST                               0x00000010
#define RCC_AHB3RSTR_JPGDECRST                              0x00000020
#define RCC_AHB3RSTR_FMCRST                                 0x00001000
#define RCC_AHB3RSTR_QSPIRST                                0x00004000
#define RCC_AHB3RSTR_SDMMC1RST                              0x00010000
#define RCC_AHB3RSTR_CPURST                                 0x80000000

