twatorowski/stm32l476-radio-receiver/stm32h743/rcc.h
/**************** bit definitions for AHB1RSTR register *****************/
#define RCC_AHB1RSTR_DMA1RST                                0x00000001
#define RCC_AHB1RSTR_DMA2RST                                0x00000002
#define RCC_AHB1RSTR_ADC12RST                               0x00000020
#define RCC_AHB1RSTR_ETH1MACRST                             0x00008000
#define RCC_AHB1RSTR_USB1OTGRST                             0x02000000
#define RCC_AHB1RSTR_USB2OTGRST                             0x08000000

/**************** bit definitions for AHB2RSTR register *****************/
#define RCC_AHB2RSTR_CAMITFRST                              0x00000001
#define RCC_AHB2RSTR_CRYPTRST                               0x00000010
#define RCC_AHB2RSTR_HASHRST                                0x00000020
#define RCC_AHB2RSTR_RNGRST                                 0x00000040
#define RCC_AHB2RSTR_SDMMC2RST                              0x00000200

/**************** bit definitions for AHB4RSTR register *****************/
#define RCC_AHB4RSTR_GPIOARST                               0x00000001
#define RCC_AHB4RSTR_GPIOBRST                               0x00000002
#define RCC_AHB4RSTR_GPIOCRST                               0x00000004
#define RCC_AHB4RSTR_GPIODRST                               0x00000008
#define RCC_AHB4RSTR_GPIOERST                               0x00000010
#define RCC_AHB4RSTR_GPIOFRST                               0x00000020
#define RCC_AHB4RSTR_GPIOGRST                               0x00000040
#define RCC_AHB4RSTR_GPIOHRST                               0x00000080
#define RCC_AHB4RSTR_GPIOIRST                               0x00000100
#define RCC_AHB4RSTR_GPIOJRST                               0x00000200
#define RCC_AHB4RSTR_GPIOKRST                               0x00000400
#define RCC_AHB4RSTR_CRCRST                                 0x00080000
#define RCC_AHB4RSTR_BDMARST                                0x00200000
#define RCC_AHB4RSTR_ADC3RST                                0x01000000
#define RCC_AHB4RSTR_HSEMRST                                0x02000000

/**************** bit definitions for APB3RSTR register *****************/
#define RCC_APB3RSTR_LTDCRST                                0x00000008

/**************** bit definitions for APB1LRSTR register ****************/
#define RCC_APB1LRSTR_TIM2RST                               0x00000001
#define RCC_APB1LRSTR_TIM3RST                               0x00000002
#define RCC_APB1LRSTR_TIM4RST                               0x00000004
#define RCC_APB1LRSTR_TIM5RST                               0x00000008
#define RCC_APB1LRSTR_TIM6RST                               0x00000010
#define RCC_APB1LRSTR_TIM7RST                               0x00000020
#define RCC_APB1LRSTR_TIM12RST                              0x00000040
#define RCC_APB1LRSTR_TIM13RST                              0x00000080
#define RCC_APB1LRSTR_TIM14RST                              0x00000100
#define RCC_APB1LRSTR_LPTIM1RST                             0x00000200
#define RCC_APB1LRSTR_SPI2RST                               0x00004000
#define RCC_APB1LRSTR_SPI3RST                               0x00008000
#define RCC_APB1LRSTR_SPDIFRXRST                            0x00010000
#define RCC_APB1LRSTR_USART2RST                             0x00020000
#define RCC_APB1LRSTR_USART3RST                             0x00040000
#define RCC_APB1LRSTR_UART4RST                              0x00080000
#define RCC_APB1LRSTR_UART5RST                              0x00100000
#define RCC_APB1LRSTR_I2C1RST                               0x00200000
#define RCC_APB1LRSTR_I2C2RST                               0x00400000
#define RCC_APB1LRSTR_I2C3RST                               0x00800000
#define RCC_APB1LRSTR_CECRST                                0x08000000
#define RCC_APB1LRSTR_DAC12RST                              0x20000000
#define RCC_APB1LRSTR_USART7RST                             0x40000000
#define RCC_APB1LRSTR_USART8RST                             0x80000000

/**************** bit definitions for APB1HRSTR register ****************/
#define RCC_APB1HRSTR_CRSRST                                0x00000002
#define RCC_APB1HRSTR_SWPRST                                0x00000004
#define RCC_APB1HRSTR_OPAMPRST                              0x00000010
#define RCC_APB1HRSTR_MDIOSRST                              0x00000020
#define RCC_APB1HRSTR_FDCANRST                              0x00000100

/**************** bit definitions for APB2RSTR register *****************/
#define RCC_APB2RSTR_TIM1RST                                0x00000001
#define RCC_APB2RSTR_TIM8RST                                0x00000002
#define RCC_APB2RSTR_USART1RST                              0x00000010
#define RCC_APB2RSTR_USART6RST                              0x00000020
#define RCC_APB2RSTR_SPI1RST                                0x00001000
#define RCC_APB2RSTR_SPI4RST                                0x00002000
#define RCC_APB2RSTR_TIM15RST                               0x00010000
#define RCC_APB2RSTR_TIM16RST                               0x00020000
#define RCC_APB2RSTR_TIM17RST                               0x00040000
#define RCC_APB2RSTR_SPI5RST                                0x00100000
#define RCC_APB2RSTR_SAI1RST                                0x00400000
#define RCC_APB2RSTR_SAI2RST                                0x00800000
#define RCC_APB2RSTR_SAI3RST                                0x01000000
#define RCC_APB2RSTR_DFSDM1RST                              0x10000000
#define RCC_APB2RSTR_HRTIMRST                               0x20000000

/**************** bit definitions for APB4RSTR register *****************/
#define RCC_APB4RSTR_SYSCFGRST                              0x00000002
#define RCC_APB4RSTR_LPUART1RST                             0x00000008
#define RCC_APB4RSTR_SPI6RST                                0x00000020
#define RCC_APB4RSTR_I2C4RST                                0x00000080
#define RCC_APB4RSTR_LPTIM2RST                              0x00000200
#define RCC_APB4RSTR_LPTIM3RST                              0x00000400
#define RCC_APB4RSTR_LPTIM4RST                              0x00000800
#define RCC_APB4RSTR_LPTIM5RST                              0x00001000
#define RCC_APB4RSTR_COMP12RST                              0x00004000
#define RCC_APB4RSTR_VREFRST                                0x00008000
#define RCC_APB4RSTR_SAI4RST                                0x00200000

/******************* bit definitions for GCR register *******************/
#define RCC_GCR_WW1RSC                                      0x00000001

/****************** bit definitions for D3AMR register ******************/
#define RCC_D3AMR_BDMAAMEN                                  0x00000001
#define RCC_D3AMR_LPUART1AMEN                               0x00000008
#define RCC_D3AMR_SPI6AMEN                                  0x00000020
#define RCC_D3AMR_I2C4AMEN                                  0x00000080
#define RCC_D3AMR_LPTIM2AMEN                                0x00000200
#define RCC_D3AMR_LPTIM3AMEN                                0x00000400
#define RCC_D3AMR_LPTIM4AMEN                                0x00000800
#define RCC_D3AMR_LPTIM5AMEN                                0x00001000
#define RCC_D3AMR_COMP12AMEN                                0x00004000
#define RCC_D3AMR_VREFAMEN                                  0x00008000
#define RCC_D3AMR_RTCAMEN                                   0x00010000
#define RCC_D3AMR_CRCAMEN                                   0x00080000
#define RCC_D3AMR_SAI4AMEN                                  0x00200000
#define RCC_D3AMR_ADC3AMEN                                  0x01000000
#define RCC_D3AMR_BKPRAMAMEN                                0x10000000
#define RCC_D3AMR_SRAM4AMEN                                 0x20000000

/******************* bit definitions for RSR register *******************/
#define RCC_RSR_RMVF                                        0x00010000
#define RCC_RSR_CPURSTF                                     0x00020000
#define RCC_RSR_D1RSTF                                      0x00080000
#define RCC_RSR_D2RSTF                                      0x00100000
#define RCC_RSR_BORRSTF                                     0x00200000
#define RCC_RSR_PINRSTF                                     0x00400000
#define RCC_RSR_PORRSTF                                     0x00800000
#define RCC_RSR_SFTRSTF                                     0x01000000
#define RCC_RSR_IWDG1RSTF                                   0x04000000
#define RCC_RSR_WWDG1RSTF                                   0x10000000
#define RCC_RSR_LPWRRSTF                                    0x40000000

