twatorowski/stm32l476-radio-receiver/stm32h743/rcc.h
/***************** bit definitions for AHB3ENR register *****************/
#define RCC_AHB3ENR_MDMAEN                                  0x00000001
#define RCC_AHB3ENR_DMA2DEN                                 0x00000010
#define RCC_AHB3ENR_JPGDECEN                                0x00000020
#define RCC_AHB3ENR_FMCEN                                   0x00001000
#define RCC_AHB3ENR_QSPIEN                                  0x00004000
#define RCC_AHB3ENR_SDMMC1EN                                0x00010000

/***************** bit definitions for AHB1ENR register *****************/
#define RCC_AHB1ENR_DMA1EN                                  0x00000001
#define RCC_AHB1ENR_DMA2EN                                  0x00000002
#define RCC_AHB1ENR_ADC12EN                                 0x00000020
#define RCC_AHB1ENR_ETH1MACEN                               0x00008000
#define RCC_AHB1ENR_ETH1TXEN                                0x00010000
#define RCC_AHB1ENR_ETH1RXEN                                0x00020000
#define RCC_AHB1ENR_USB2OTGHSULPIEN                         0x00040000
#define RCC_AHB1ENR_USB1OTGEN                               0x02000000
#define RCC_AHB1ENR_USB1ULPIEN                              0x04000000
#define RCC_AHB1ENR_USB2OTGEN                               0x08000000
#define RCC_AHB1ENR_USB2ULPIEN                              0x10000000

/***************** bit definitions for AHB2ENR register *****************/
#define RCC_AHB2ENR_CAMITFEN                                0x00000001
#define RCC_AHB2ENR_CRYPTEN                                 0x00000010
#define RCC_AHB2ENR_HASHEN                                  0x00000020
#define RCC_AHB2ENR_RNGEN                                   0x00000040
#define RCC_AHB2ENR_SDMMC2EN                                0x00000200
#define RCC_AHB2ENR_SRAM1EN                                 0x20000000
#define RCC_AHB2ENR_SRAM2EN                                 0x40000000
#define RCC_AHB2ENR_SRAM3EN                                 0x80000000

/***************** bit definitions for AHB4ENR register *****************/
#define RCC_AHB4ENR_GPIOAEN                                 0x00000001
#define RCC_AHB4ENR_GPIOBEN                                 0x00000002
#define RCC_AHB4ENR_GPIOCEN                                 0x00000004
#define RCC_AHB4ENR_GPIODEN                                 0x00000008
#define RCC_AHB4ENR_GPIOEEN                                 0x00000010
#define RCC_AHB4ENR_GPIOFEN                                 0x00000020
#define RCC_AHB4ENR_GPIOGEN                                 0x00000040
#define RCC_AHB4ENR_GPIOHEN                                 0x00000080
#define RCC_AHB4ENR_GPIOIEN                                 0x00000100
#define RCC_AHB4ENR_GPIOJEN                                 0x00000200
#define RCC_AHB4ENR_GPIOKEN                                 0x00000400
#define RCC_AHB4ENR_CRCEN                                   0x00080000
#define RCC_AHB4ENR_BDMAEN                                  0x00200000
#define RCC_AHB4ENR_ADC3EN                                  0x01000000
#define RCC_AHB4ENR_HSEMEN                                  0x02000000
#define RCC_AHB4ENR_BKPRAMEN                                0x10000000

/***************** bit definitions for APB3ENR register *****************/
#define RCC_APB3ENR_LTDCEN                                  0x00000008
#define RCC_APB3ENR_WWDG1EN                                 0x00000040

/**************** bit definitions for APB1LENR register *****************/
#define RCC_APB1LENR_TIM2EN                                 0x00000001
#define RCC_APB1LENR_TIM3EN                                 0x00000002
#define RCC_APB1LENR_TIM4EN                                 0x00000004
#define RCC_APB1LENR_TIM5EN                                 0x00000008
#define RCC_APB1LENR_TIM6EN                                 0x00000010
#define RCC_APB1LENR_TIM7EN                                 0x00000020
#define RCC_APB1LENR_TIM12EN                                0x00000040
#define RCC_APB1LENR_TIM13EN                                0x00000080
#define RCC_APB1LENR_TIM14EN                                0x00000100
#define RCC_APB1LENR_LPTIM1EN                               0x00000200
#define RCC_APB1LENR_SPI2EN                                 0x00004000
#define RCC_APB1LENR_SPI3EN                                 0x00008000
#define RCC_APB1LENR_SPDIFRXEN                              0x00010000
#define RCC_APB1LENR_USART2EN                               0x00020000
#define RCC_APB1LENR_USART3EN                               0x00040000
#define RCC_APB1LENR_UART4EN                                0x00080000
#define RCC_APB1LENR_UART5EN                                0x00100000
#define RCC_APB1LENR_I2C1EN                                 0x00200000
#define RCC_APB1LENR_I2C2EN                                 0x00400000
#define RCC_APB1LENR_I2C3EN                                 0x00800000
#define RCC_APB1LENR_CECEN                                  0x08000000
#define RCC_APB1LENR_DAC12EN                                0x20000000
#define RCC_APB1LENR_USART7EN                               0x40000000
#define RCC_APB1LENR_USART8EN                               0x80000000

/**************** bit definitions for APB1HENR register *****************/
#define RCC_APB1HENR_CRSEN                                  0x00000002
#define RCC_APB1HENR_SWPEN                                  0x00000004
#define RCC_APB1HENR_OPAMPEN                                0x00000010
#define RCC_APB1HENR_MDIOSEN                                0x00000020
#define RCC_APB1HENR_FDCANEN                                0x00000100

/***************** bit definitions for APB2ENR register *****************/
#define RCC_APB2ENR_TIM1EN                                  0x00000001
#define RCC_APB2ENR_TIM8EN                                  0x00000002
#define RCC_APB2ENR_USART1EN                                0x00000010
#define RCC_APB2ENR_USART6EN                                0x00000020
#define RCC_APB2ENR_SPI1EN                                  0x00001000
#define RCC_APB2ENR_SPI4EN                                  0x00002000
#define RCC_APB2ENR_TIM16EN                                 0x00020000
#define RCC_APB2ENR_TIM15EN                                 0x00010000
#define RCC_APB2ENR_TIM17EN                                 0x00040000
#define RCC_APB2ENR_SPI5EN                                  0x00100000
#define RCC_APB2ENR_SAI1EN                                  0x00400000
#define RCC_APB2ENR_SAI2EN                                  0x00800000
#define RCC_APB2ENR_SAI3EN                                  0x01000000
#define RCC_APB2ENR_DFSDM1EN                                0x10000000
#define RCC_APB2ENR_HRTIMEN                                 0x20000000

/***************** bit definitions for APB4ENR register *****************/
#define RCC_APB4ENR_SYSCFGEN                                0x00000002
#define RCC_APB4ENR_LPUART1EN                               0x00000008
#define RCC_APB4ENR_SPI6EN                                  0x00000020
#define RCC_APB4ENR_I2C4EN                                  0x00000080
#define RCC_APB4ENR_LPTIM2EN                                0x00000200
#define RCC_APB4ENR_LPTIM3EN                                0x00000400
#define RCC_APB4ENR_LPTIM4EN                                0x00000800
#define RCC_APB4ENR_LPTIM5EN                                0x00001000
#define RCC_APB4ENR_COMP12EN                                0x00004000
#define RCC_APB4ENR_VREFEN                                  0x00008000
#define RCC_APB4ENR_RTCAPBEN                                0x00010000
#define RCC_APB4ENR_SAI4EN                                  0x00200000

/**************** bit definitions for AHB3LPENR register ****************/
#define RCC_AHB3LPENR_MDMALPEN                              0x00000001
#define RCC_AHB3LPENR_DMA2DLPEN                             0x00000010
#define RCC_AHB3LPENR_JPGDECLPEN                            0x00000020
#define RCC_AHB3LPENR_FLASHLPEN                             0x00000100
#define RCC_AHB3LPENR_FMCLPEN                               0x00001000
#define RCC_AHB3LPENR_QSPILPEN                              0x00004000
#define RCC_AHB3LPENR_SDMMC1LPEN                            0x00010000
#define RCC_AHB3LPENR_D1DTCM1LPEN                           0x10000000
#define RCC_AHB3LPENR_DTCM2LPEN                             0x20000000
#define RCC_AHB3LPENR_ITCMLPEN                              0x40000000
#define RCC_AHB3LPENR_AXISRAMLPEN                           0x80000000

/**************** bit definitions for AHB1LPENR register ****************/
#define RCC_AHB1LPENR_DMA1LPEN                              0x00000001
#define RCC_AHB1LPENR_DMA2LPEN                              0x00000002
#define RCC_AHB1LPENR_ADC12LPEN                             0x00000020
#define RCC_AHB1LPENR_ETH1MACLPEN                           0x00008000
#define RCC_AHB1LPENR_ETH1TXLPEN                            0x00010000
#define RCC_AHB1LPENR_ETH1RXLPEN                            0x00020000
#define RCC_AHB1LPENR_USB1OTGHSLPEN                         0x02000000
#define RCC_AHB1LPENR_USB1OTGHSULPILPEN                     0x04000000
#define RCC_AHB1LPENR_USB2OTGHSLPEN                         0x08000000
#define RCC_AHB1LPENR_USB2OTGHSULPILPEN                     0x10000000

/**************** bit definitions for AHB2LPENR register ****************/
#define RCC_AHB2LPENR_CAMITFLPEN                            0x00000001
#define RCC_AHB2LPENR_CRYPTLPEN                             0x00000010
#define RCC_AHB2LPENR_HASHLPEN                              0x00000020
#define RCC_AHB2LPENR_SDMMC2LPEN                            0x00000200
#define RCC_AHB2LPENR_RNGLPEN                               0x00000040
#define RCC_AHB2LPENR_SRAM1LPEN                             0x20000000
#define RCC_AHB2LPENR_SRAM2LPEN                             0x40000000
#define RCC_AHB2LPENR_SRAM3LPEN                             0x80000000

