twatorowski/stm32l476-radio-receiver/stm32h743/rcc.h
/**************** bit definitions for AHB4LPENR register ****************/
#define RCC_AHB4LPENR_GPIOALPEN                             0x00000001
#define RCC_AHB4LPENR_GPIOBLPEN                             0x00000002
#define RCC_AHB4LPENR_GPIOCLPEN                             0x00000004
#define RCC_AHB4LPENR_GPIODLPEN                             0x00000008
#define RCC_AHB4LPENR_GPIOELPEN                             0x00000010
#define RCC_AHB4LPENR_GPIOFLPEN                             0x00000020
#define RCC_AHB4LPENR_GPIOGLPEN                             0x00000040
#define RCC_AHB4LPENR_GPIOHLPEN                             0x00000080
#define RCC_AHB4LPENR_GPIOILPEN                             0x00000100
#define RCC_AHB4LPENR_GPIOJLPEN                             0x00000200
#define RCC_AHB4LPENR_GPIOKLPEN                             0x00000400
#define RCC_AHB4LPENR_CRCLPEN                               0x00080000
#define RCC_AHB4LPENR_BDMALPEN                              0x00200000
#define RCC_AHB4LPENR_ADC3LPEN                              0x01000000
#define RCC_AHB4LPENR_BKPRAMLPEN                            0x10000000
#define RCC_AHB4LPENR_SRAM4LPEN                             0x20000000

/**************** bit definitions for APB3LPENR register ****************/
#define RCC_APB3LPENR_LTDCLPEN                              0x00000008
#define RCC_APB3LPENR_WWDG1LPEN                             0x00000040

/*************** bit definitions for APB1LLPENR register ****************/
#define RCC_APB1LLPENR_TIM2LPEN                             0x00000001
#define RCC_APB1LLPENR_TIM3LPEN                             0x00000002
#define RCC_APB1LLPENR_TIM4LPEN                             0x00000004
#define RCC_APB1LLPENR_TIM5LPEN                             0x00000008
#define RCC_APB1LLPENR_TIM6LPEN                             0x00000010
#define RCC_APB1LLPENR_TIM7LPEN                             0x00000020
#define RCC_APB1LLPENR_TIM12LPEN                            0x00000040
#define RCC_APB1LLPENR_TIM13LPEN                            0x00000080
#define RCC_APB1LLPENR_TIM14LPEN                            0x00000100
#define RCC_APB1LLPENR_LPTIM1LPEN                           0x00000200
#define RCC_APB1LLPENR_SPI2LPEN                             0x00004000
#define RCC_APB1LLPENR_SPI3LPEN                             0x00008000
#define RCC_APB1LLPENR_SPDIFRXLPEN                          0x00010000
#define RCC_APB1LLPENR_USART2LPEN                           0x00020000
#define RCC_APB1LLPENR_USART3LPEN                           0x00040000
#define RCC_APB1LLPENR_UART4LPEN                            0x00080000
#define RCC_APB1LLPENR_UART5LPEN                            0x00100000
#define RCC_APB1LLPENR_I2C1LPEN                             0x00200000
#define RCC_APB1LLPENR_I2C2LPEN                             0x00400000
#define RCC_APB1LLPENR_I2C3LPEN                             0x00800000
#define RCC_APB1LLPENR_HDMICECLPEN                          0x08000000
#define RCC_APB1LLPENR_DAC12LPEN                            0x20000000
#define RCC_APB1LLPENR_USART7LPEN                           0x40000000
#define RCC_APB1LLPENR_USART8LPEN                           0x80000000

/*************** bit definitions for APB1HLPENR register ****************/
#define RCC_APB1HLPENR_CRSLPEN                              0x00000002
#define RCC_APB1HLPENR_SWPLPEN                              0x00000004
#define RCC_APB1HLPENR_OPAMPLPEN                            0x00000010
#define RCC_APB1HLPENR_MDIOSLPEN                            0x00000020
#define RCC_APB1HLPENR_FDCANLPEN                            0x00000100

/**************** bit definitions for APB2LPENR register ****************/
#define RCC_APB2LPENR_TIM1LPEN                              0x00000001
#define RCC_APB2LPENR_TIM8LPEN                              0x00000002
#define RCC_APB2LPENR_USART1LPEN                            0x00000010
#define RCC_APB2LPENR_USART6LPEN                            0x00000020
#define RCC_APB2LPENR_SPI1LPEN                              0x00001000
#define RCC_APB2LPENR_SPI4LPEN                              0x00002000
#define RCC_APB2LPENR_TIM15LPEN                             0x00010000
#define RCC_APB2LPENR_TIM16LPEN                             0x00020000
#define RCC_APB2LPENR_TIM17LPEN                             0x00040000
#define RCC_APB2LPENR_SPI5LPEN                              0x00100000
#define RCC_APB2LPENR_SAI1LPEN                              0x00400000
#define RCC_APB2LPENR_SAI2LPEN                              0x00800000
#define RCC_APB2LPENR_SAI3LPEN                              0x01000000
#define RCC_APB2LPENR_DFSDM1LPEN                            0x10000000
#define RCC_APB2LPENR_HRTIMLPEN                             0x20000000

/**************** bit definitions for APB4LPENR register ****************/
#define RCC_APB4LPENR_SYSCFGLPEN                            0x00000002
#define RCC_APB4LPENR_LPUART1LPEN                           0x00000008
#define RCC_APB4LPENR_SPI6LPEN                              0x00000020
#define RCC_APB4LPENR_I2C4LPEN                              0x00000080
#define RCC_APB4LPENR_LPTIM2LPEN                            0x00000200
#define RCC_APB4LPENR_LPTIM3LPEN                            0x00000400
#define RCC_APB4LPENR_LPTIM4LPEN                            0x00000800
#define RCC_APB4LPENR_LPTIM5LPEN                            0x00001000
#define RCC_APB4LPENR_COMP12LPEN                            0x00004000
#define RCC_APB4LPENR_VREFLPEN                              0x00008000
#define RCC_APB4LPENR_RTCAPBLPEN                            0x00010000
#define RCC_APB4LPENR_SAI4LPEN                              0x00200000

/***************** bit definitions for C1_RSR register ******************/
#define RCC_C1_RSR_RMVF                                     0x00010000
#define RCC_C1_RSR_CPURSTF                                  0x00020000
#define RCC_C1_RSR_D1RSTF                                   0x00080000
#define RCC_C1_RSR_D2RSTF                                   0x00100000
#define RCC_C1_RSR_BORRSTF                                  0x00200000
#define RCC_C1_RSR_PINRSTF                                  0x00400000
#define RCC_C1_RSR_PORRSTF                                  0x00800000
#define RCC_C1_RSR_SFTRSTF                                  0x01000000
#define RCC_C1_RSR_IWDG1RSTF                                0x04000000
#define RCC_C1_RSR_WWDG1RSTF                                0x10000000
#define RCC_C1_RSR_LPWRRSTF                                 0x40000000

/*************** bit definitions for C1_AHB3ENR register ****************/
#define RCC_C1_AHB3ENR_MDMAEN                               0x00000001
#define RCC_C1_AHB3ENR_DMA2DEN                              0x00000010
#define RCC_C1_AHB3ENR_JPGDECEN                             0x00000020
#define RCC_C1_AHB3ENR_FMCEN                                0x00001000
#define RCC_C1_AHB3ENR_QSPIEN                               0x00004000
#define RCC_C1_AHB3ENR_SDMMC1EN                             0x00010000

