twatorowski/stm32l476-radio-receiver/stm32h743/rcc.h
/************** bit definitions for C1_AHB3LPENR register ***************/
#define RCC_C1_AHB3LPENR_MDMALPEN                           0x00000001
#define RCC_C1_AHB3LPENR_DMA2DLPEN                          0x00000010
#define RCC_C1_AHB3LPENR_JPGDECLPEN                         0x00000020
#define RCC_C1_AHB3LPENR_FLITFLPEN                          0x00000100
#define RCC_C1_AHB3LPENR_FMCLPEN                            0x00001000
#define RCC_C1_AHB3LPENR_QSPILPEN                           0x00004000
#define RCC_C1_AHB3LPENR_SDMMC1LPEN                         0x00010000
#define RCC_C1_AHB3LPENR_D1DTCM1LPEN                        0x10000000
#define RCC_C1_AHB3LPENR_DTCM2LPEN                          0x20000000
#define RCC_C1_AHB3LPENR_ITCMLPEN                           0x40000000
#define RCC_C1_AHB3LPENR_AXISRAMLPEN                        0x80000000

/************** bit definitions for C1_AHB1LPENR register ***************/
#define RCC_C1_AHB1LPENR_DMA1LPEN                           0x00000001
#define RCC_C1_AHB1LPENR_DMA2LPEN                           0x00000002
#define RCC_C1_AHB1LPENR_ADC12LPEN                          0x00000020
#define RCC_C1_AHB1LPENR_ETH1MACLPEN                        0x00008000
#define RCC_C1_AHB1LPENR_ETH1TXLPEN                         0x00010000
#define RCC_C1_AHB1LPENR_ETH1RXLPEN                         0x00020000
#define RCC_C1_AHB1LPENR_USB1OTGLPEN                        0x02000000
#define RCC_C1_AHB1LPENR_USB1ULPILPEN                       0x04000000
#define RCC_C1_AHB1LPENR_USB2OTGLPEN                        0x08000000
#define RCC_C1_AHB1LPENR_USB2ULPILPEN                       0x10000000

/************** bit definitions for C1_AHB2LPENR register ***************/
#define RCC_C1_AHB2LPENR_CAMITFLPEN                         0x00000001
#define RCC_C1_AHB2LPENR_CRYPTLPEN                          0x00000010
#define RCC_C1_AHB2LPENR_HASHLPEN                           0x00000020
#define RCC_C1_AHB2LPENR_SDMMC2LPEN                         0x00000200
#define RCC_C1_AHB2LPENR_RNGLPEN                            0x00000040
#define RCC_C1_AHB2LPENR_SRAM1LPEN                          0x20000000
#define RCC_C1_AHB2LPENR_SRAM2LPEN                          0x40000000
#define RCC_C1_AHB2LPENR_SRAM3LPEN                          0x80000000

/************** bit definitions for C1_AHB4LPENR register ***************/
#define RCC_C1_AHB4LPENR_GPIOALPEN                          0x00000001
#define RCC_C1_AHB4LPENR_GPIOBLPEN                          0x00000002
#define RCC_C1_AHB4LPENR_GPIOCLPEN                          0x00000004
#define RCC_C1_AHB4LPENR_GPIODLPEN                          0x00000008
#define RCC_C1_AHB4LPENR_GPIOELPEN                          0x00000010
#define RCC_C1_AHB4LPENR_GPIOFLPEN                          0x00000020
#define RCC_C1_AHB4LPENR_GPIOGLPEN                          0x00000040
#define RCC_C1_AHB4LPENR_GPIOHLPEN                          0x00000080
#define RCC_C1_AHB4LPENR_GPIOILPEN                          0x00000100
#define RCC_C1_AHB4LPENR_GPIOJLPEN                          0x00000200
#define RCC_C1_AHB4LPENR_GPIOKLPEN                          0x00000400
#define RCC_C1_AHB4LPENR_CRCLPEN                            0x00080000
#define RCC_C1_AHB4LPENR_BDMALPEN                           0x00200000
#define RCC_C1_AHB4LPENR_ADC3LPEN                           0x01000000
#define RCC_C1_AHB4LPENR_BKPRAMLPEN                         0x10000000
#define RCC_C1_AHB4LPENR_SRAM4LPEN                          0x20000000

/************** bit definitions for C1_APB3LPENR register ***************/
#define RCC_C1_APB3LPENR_LTDCLPEN                           0x00000008
#define RCC_C1_APB3LPENR_WWDG1LPEN                          0x00000040

/************** bit definitions for C1_APB1LLPENR register **************/
#define RCC_C1_APB1LLPENR_TIM2LPEN                          0x00000001
#define RCC_C1_APB1LLPENR_TIM3LPEN                          0x00000002
#define RCC_C1_APB1LLPENR_TIM4LPEN                          0x00000004
#define RCC_C1_APB1LLPENR_TIM5LPEN                          0x00000008
#define RCC_C1_APB1LLPENR_TIM6LPEN                          0x00000010
#define RCC_C1_APB1LLPENR_TIM7LPEN                          0x00000020
#define RCC_C1_APB1LLPENR_TIM12LPEN                         0x00000040
#define RCC_C1_APB1LLPENR_TIM13LPEN                         0x00000080
#define RCC_C1_APB1LLPENR_TIM14LPEN                         0x00000100
#define RCC_C1_APB1LLPENR_LPTIM1LPEN                        0x00000200
#define RCC_C1_APB1LLPENR_SPI2LPEN                          0x00004000
#define RCC_C1_APB1LLPENR_SPI3LPEN                          0x00008000
#define RCC_C1_APB1LLPENR_SPDIFRXLPEN                       0x00010000
#define RCC_C1_APB1LLPENR_USART2LPEN                        0x00020000
#define RCC_C1_APB1LLPENR_USART3LPEN                        0x00040000
#define RCC_C1_APB1LLPENR_UART4LPEN                         0x00080000
#define RCC_C1_APB1LLPENR_UART5LPEN                         0x00100000
#define RCC_C1_APB1LLPENR_I2C1LPEN                          0x00200000
#define RCC_C1_APB1LLPENR_I2C2LPEN                          0x00400000
#define RCC_C1_APB1LLPENR_I2C3LPEN                          0x00800000
#define RCC_C1_APB1LLPENR_HDMICECLPEN                       0x08000000
#define RCC_C1_APB1LLPENR_DAC12LPEN                         0x20000000
#define RCC_C1_APB1LLPENR_USART7LPEN                        0x40000000
#define RCC_C1_APB1LLPENR_USART8LPEN                        0x80000000

/************** bit definitions for C1_APB1HLPENR register **************/
#define RCC_C1_APB1HLPENR_CRSLPEN                           0x00000002
#define RCC_C1_APB1HLPENR_SWPLPEN                           0x00000004
#define RCC_C1_APB1HLPENR_OPAMPLPEN                         0x00000010
#define RCC_C1_APB1HLPENR_MDIOSLPEN                         0x00000020
#define RCC_C1_APB1HLPENR_FDCANLPEN                         0x00000100

