twatorowski/stm32l476-radio-receiver/stm32h743/rcc.h
/************** bit definitions for C1_APB2LPENR register ***************/
#define RCC_C1_APB2LPENR_TIM1LPEN                           0x00000001
#define RCC_C1_APB2LPENR_TIM8LPEN                           0x00000002
#define RCC_C1_APB2LPENR_USART1LPEN                         0x00000010
#define RCC_C1_APB2LPENR_USART6LPEN                         0x00000020
#define RCC_C1_APB2LPENR_SPI1LPEN                           0x00001000
#define RCC_C1_APB2LPENR_SPI4LPEN                           0x00002000
#define RCC_C1_APB2LPENR_TIM15LPEN                          0x00010000
#define RCC_C1_APB2LPENR_TIM16LPEN                          0x00020000
#define RCC_C1_APB2LPENR_TIM17LPEN                          0x00040000
#define RCC_C1_APB2LPENR_SPI5LPEN                           0x00100000
#define RCC_C1_APB2LPENR_SAI1LPEN                           0x00400000
#define RCC_C1_APB2LPENR_SAI2LPEN                           0x00800000
#define RCC_C1_APB2LPENR_SAI3LPEN                           0x01000000
#define RCC_C1_APB2LPENR_DFSDM1LPEN                         0x10000000
#define RCC_C1_APB2LPENR_HRTIMLPEN                          0x20000000

/************** bit definitions for C1_APB4LPENR register ***************/
#define RCC_C1_APB4LPENR_SYSCFGLPEN                         0x00000002
#define RCC_C1_APB4LPENR_LPUART1LPEN                        0x00000008
#define RCC_C1_APB4LPENR_SPI6LPEN                           0x00000020
#define RCC_C1_APB4LPENR_I2C4LPEN                           0x00000080
#define RCC_C1_APB4LPENR_LPTIM2LPEN                         0x00000200
#define RCC_C1_APB4LPENR_LPTIM3LPEN                         0x00000400
#define RCC_C1_APB4LPENR_LPTIM4LPEN                         0x00000800
#define RCC_C1_APB4LPENR_LPTIM5LPEN                         0x00001000
#define RCC_C1_APB4LPENR_COMP12LPEN                         0x00004000
#define RCC_C1_APB4LPENR_VREFLPEN                           0x00008000
#define RCC_C1_APB4LPENR_RTCAPBLPEN                         0x00010000
#define RCC_C1_APB4LPENR_SAI4LPEN                           0x00200000

#endif /* STM32H743_RCC_H */
